kernel/net/infra_com_init.org
#+TITLE: 用于组件初始化的内核基础设施
#+AUTHOR: Cauchy(pqy7172@gmail.com)
#+OPTIONS: ^:nil
#+EMAIL: pqy7172@gmail.com
#+HTML_HEAD: <link rel="stylesheet" href="../../org-manual.css" type="text/css">

本文介绍一些内核基础设施, 在内核组件初始化时, 会用到这些工具(设施).

为了彻底的理解一个内核组件, 除了理解相应组件的函数的功能, 也要清楚这些函数在什么时候被谁调用. 

本文会介绍一些内核组件初始化的公用函数, 这些公用的用于组件初始化的函数不论是静态内建的代码还是模块代码都会用到. 大概会介绍到以下几方面:
1) 初始化函数是如何命名以及如何由特殊的宏标识.
2) 基于内核配置, 这些宏是如何被定义以及它们被用来优化内存使用, 和用来确保各种初始化操作按照正确的顺序来完成.
3) 什么时候以及怎样执行这些函数.

* 启动时内核选项
Linux内核允许把配置选项传递给它, 采用这种方式可以微调内核。两次调用 *parse_args* 函数用来解析启动时的配置。
* 模块初始化代码
* 基于宏的标签
* 启动时初始化例程
* 内存优化
