kernel/net/infra_com_init.html
<!DOCTYPE html>
<html lang="cn">
<head>
<!-- 2021-01-27 Wed 23:03 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>用于组件初始化的内核基础设施</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Cauchy(pqy7172@gmail.com)">
<link rel="stylesheet" href="../../org-manual.css" type="text/css">
</head>
<body>
<div id="content">
<h1 class="title">用于组件初始化的内核基础设施</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9c335f6">1. 启动时内核选项</a></li>
<li><a href="#org54a5a03">2. 模块初始化代码</a></li>
<li><a href="#org5b68b78">3. 基于宏的标签</a></li>
<li><a href="#orgad955d1">4. 启动时初始化例程</a></li>
<li><a href="#orgc9a6bf9">5. 内存优化</a></li>
</ul>
</div>
</div>
<p>
本文介绍一些内核基础设施, 在内核组件初始化时, 会用到这些工具(设施).
</p>

<p>
为了彻底的理解一个内核组件, 除了理解相应组件的函数的功能, 也要清楚这些函数在什么时候被谁调用. 
</p>

<p>
本文是介绍一些内核组件初始化的公用函数, 这些公用的用于组件初始化的函数不论是静态内建的代码还是模块代码都会用到. 大概会介绍到以下几方面:
</p>
<ol class="org-ol">
<li>初始化函数是如何命名以及如何由特殊的宏标识.</li>
<li>基于内核配置, 这些宏是如何被定义以及它们被用来优化内存使用, 和用来确保各种初始化操作按照正确的顺序来完成.</li>
<li>什么时候以及怎样执行这些函数.</li>
</ol>

<div id="outline-container-org9c335f6" class="outline-2">
<h2 id="org9c335f6"><span class="section-number-2">1</span> 启动时内核选项</h2>
<div class="outline-text-2" id="text-1">
<p>
Linux内核允许把配置选项传递给它, 采用这种方式可以微调内核。两次调用parse_args函数用来解析启动时的配置。
</p>
</div>
</div>
<div id="outline-container-org54a5a03" class="outline-2">
<h2 id="org54a5a03"><span class="section-number-2">2</span> 模块初始化代码</h2>
</div>
<div id="outline-container-org5b68b78" class="outline-2">
<h2 id="org5b68b78"><span class="section-number-2">3</span> 基于宏的标签</h2>
</div>
<div id="outline-container-orgad955d1" class="outline-2">
<h2 id="orgad955d1"><span class="section-number-2">4</span> 启动时初始化例程</h2>
</div>
<div id="outline-container-orgc9a6bf9" class="outline-2">
<h2 id="orgc9a6bf9"><span class="section-number-2">5</span> 内存优化</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Cauchy(pqy7172@gmail.com)</p>
<p class="date">Created: 2021-01-27 Wed 23:03</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
